<?php
use Migrations\AbstractSeed;

/**
 * Characters seed.
 */
class CharactersSeed extends AbstractSeed
{
    /**
     * Run Method.
     *
     * Write your database seeder using this method.
     *
     * More information on writing seeds is available here:
     * http://docs.phinx.org/en/latest/seeding.html
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'id' => '1',
                'name' => '天海春香',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '2',
                'name' => '如月千早',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '3',
                'name' => '星井美希',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '4',
                'name' => '萩原雪歩',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '5',
                'name' => '高槻やよい',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '6',
                'name' => '菊地真',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '7',
                'name' => '水瀬伊織',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '8',
                'name' => '四条貴音',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '9',
                'name' => '秋月律子',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '10',
                'name' => '三浦あずさ',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '11',
                'name' => '双海亜美',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '12',
                'name' => '双海真美',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '13',
                'name' => '我那覇響',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '14',
                'name' => '春日未来',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '15',
                'name' => '最上静香',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '16',
                'name' => '伊吹翼',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '17',
                'name' => '田中琴葉',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '18',
                'name' => '島原エレナ',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '19',
                'name' => '佐竹美奈子',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '20',
                'name' => '所恵美',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '21',
                'name' => '徳川まつり',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '22',
                'name' => '箱崎星梨花',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '23',
                'name' => '野々原茜',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '24',
                'name' => '望月杏奈',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '25',
                'name' => 'ロコ',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '26',
                'name' => '七尾百合子',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '27',
                'name' => '高山紗代子',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '28',
                'name' => '松田亜利沙',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '29',
                'name' => '高坂海美',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '30',
                'name' => '中谷育',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '31',
                'name' => '天空橋朋花',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '32',
                'name' => 'エミリー',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '33',
                'name' => '北沢志保',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '34',
                'name' => '舞浜歩',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '35',
                'name' => '木下ひなた',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '36',
                'name' => '矢吹可奈',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '37',
                'name' => '横山奈緒',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '38',
                'name' => '二階堂千鶴',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '39',
                'name' => '馬場このみ',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '40',
                'name' => '大神環',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '41',
                'name' => '豊川風花',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '42',
                'name' => '宮尾美也',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '43',
                'name' => '福田のり子',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '44',
                'name' => '真壁瑞希',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '45',
                'name' => '篠宮可憐',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '46',
                'name' => '百瀬莉緒',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '47',
                'name' => '永吉昴',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '48',
                'name' => '北上麗花',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '49',
                'name' => '周防桃子',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '50',
                'name' => 'ジュリア',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '51',
                'name' => '白石紬',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '52',
                'name' => '桜守歌織',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '53',
                'name' => '詩花',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
            [
                'id' => '54',
                'name' => '玲音',
                'created' => '2020-01-03 13:00:00',
                'modified' => '2020-01-03 13:00:00',
            ],
        ];

        $table = $this->table('characters');
        $table->truncate();
        $table->insert($data)->save();
    }
}
